; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v1)
		(pred_2 ?v7)
		(pred_6 ?v8)
		(pred_1 ?v8)
		(pred_5 ?v7 ?v8)
		(pred_3)
		(pred_4 ?v7))

   (:action op_2
       :parameters  (?v5 ?v6)
       :precondition (and (not-eq ?v5 ?v6) 
                          (pred_6 ?v5) (pred_6 ?v6) (pred_1 ?v5))
       :effect (and  (pred_1 ?v6)
		     (not (pred_1 ?v5))))


   (:action op_3
       :parameters (?v3 ?v4)
       :precondition  (and  (pred_2 ?v3) (pred_6 ?v4)
			    (pred_5 ?v3 ?v4) (pred_1 ?v4) (pred_3))
       :effect (and (pred_4 ?v3)
		    (not (pred_5 ?v3 ?v4)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v3  ?v4)
       :precondition  (and  (pred_2 ?v3) (pred_6 ?v4)
			    (pred_4 ?v3) (pred_1 ?v4))
       :effect (and (pred_5 ?v3 ?v4)
		    (pred_3)
		    (not (pred_4 ?v3)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_02 obj_01 obj_03 
          obj_04 obj_05 
)
(:init
(pred_6 obj_02)
(pred_6 obj_01)
(pred_6 obj_03)
(pred_2 obj_04)
(pred_2 obj_05)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(pred_3)
(pred_5 obj_04 obj_03)
(pred_5 obj_05 obj_01)
(pred_1 obj_01)
)
(:goal
(and
(pred_5 obj_04 obj_03)
(pred_5 obj_05 obj_03)
)
)

(:constraints
  (sometime-before  (pred_5 obj_05 obj_03) (pred_1 obj_02))
)
)

; plan
1. (op_3 obj_05 obj_01)
   deleted: (pred_5 obj_05 obj_01) (pred_3)
   added: (pred_4 obj_05)
   goals met: 1 of 2
2. (op_2 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 1 of 2
3. (op_1 obj_05 obj_02)
   deleted: (pred_4 obj_05)
   added: (pred_5 obj_05 obj_02) (pred_3)
   goals met: 1 of 2
4. (op_2 obj_02 obj_03)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_03)
   goals met: 1 of 2
5. (op_3 obj_04 obj_03)
   deleted: (pred_5 obj_04 obj_03) (pred_3)
   added: (pred_4 obj_04)
   goals met: 0 of 2
6. (op_2 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 0 of 2
7. (op_1 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_5 obj_04 obj_02) (pred_3)
   goals met: 0 of 2
8. (op_3 obj_05 obj_02)
   deleted: (pred_5 obj_05 obj_02) (pred_3)
   added: (pred_4 obj_05)
   goals met: 0 of 2
9. (op_2 obj_02 obj_03)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_03)
   goals met: 0 of 2
10. (op_1 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_5 obj_05 obj_03) (pred_3)
   goals met: 1 of 2
11. (op_2 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 1 of 2
12. (op_3 obj_04 obj_02)
   deleted: (pred_5 obj_04 obj_02) (pred_3)
   added: (pred_4 obj_04)
   goals met: 1 of 2
13. (op_2 obj_02 obj_03)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_03)
   goals met: 1 of 2
14. (op_1 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_5 obj_04 obj_03) (pred_3)
   goals met: 2 of 2
